app/Modules/Core/DataView/Models/DataViewConstructorModel.php

SELECT *
FROM `ban_fields`
ORDER BY `label`
---
    public function getDescriptorBrut()
    {
        $builder=$this->db->table("ban_fields");
        $builder->orderBy("label");
        $fields=$builder->get()->getResult();

SELECT *
FROM `ban_fields`
---
    public function getFields()
    {
        $builder=$this->db->table("ban_fields");
        $fields=$builder->get()->getResult();

        foreach($fields as $field)
        {
            foreach($field as $k=>$v)
            {
                if($k!="field_index")
                {
                    $data[$field->field_index][$k]=$v;
                }
            }
        }

        $data["key_entity"]["inscriptions"]="id_inscription";

        if(isset($data))
        {
            $builder=$this->db->table("ban_entities_params");
            $params=$builder->get()->getResult();